Hello @brunoagueda I wasn't able to reproduce the issue, pasted config works fine from my side:
```
terraform apply

Terraform used the selected providers to generate the following execution plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # opentelekomcloud_cts_tracker_v3.tracker_v3 will be created
  + resource "opentelekomcloud_cts_tracker_v3" "tracker_v3" {
      + bucket_lifecycle = (known after apply)
      + bucket_name      = "tf-test-bucket"
      + detail           = (known after apply)
      + domain_id        = (known after apply)
      + file_prefix_name = "prefix"
      + id               = (known after apply)
      + is_lts_enabled   = true
      + is_obs_created   = (known after apply)
      + log_group_name   = (known after apply)
      + log_topic_name   = (known after apply)
      + project_id       = (known after apply)
      + status           = "enabled"
      + tracker_name     = (known after apply)
      + tracker_type     = (known after apply)
    }

Plan: 1 to add, 0 to change, 0 to destroy.

Do you want to perform these actions?
  Terraform will perform the actions described above.
  Only 'yes' will be accepted to approve.

  Enter a value: yes

opentelekomcloud_cts_tracker_v3.tracker_v3: Creating...
opentelekomcloud_cts_tracker_v3.tracker_v3: Creation complete after 2s [id=system]

Apply complete! Resources: 1 added, 0 changed, 0 destroyed.
```

From your gist output it looks that the problem is either with connection or OTC itself:
```
error: error creating CTS tracker: Post &quot;https://cts.eu-ch2.sc.otc.t-systems.com/v3/755d5f9ad38f41d4a2f473f8f1b33393/tracker&quot;: 
OpenTelecomCloud connection error, retries exhausted. Aborting. Last error was: dial tcp: lookup cts.eu-ch2.sc.otc.t-systems.com on 53.250.16.157:53: no such host
```
So I would suggest contacting OTC support in this case and opening customer ticket.